const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container">
      <div>
        <h4>1. ЯКУ ІНФОРМАЦІЮ МИ ЗБИРАЄМО?</h4>

        <div>
          <h5>Особиста інформація, яку ви надаєте нам</h5>
          <p>
            Ми збираємо особисту інформацію, яку ви добровільно надаєте нам,
            коли виявляєте зацікавленість у отриманні інформації про нас або
            наші продукти та Послуги, коли берете участь у діяльності в межах
            Послуг або коли іншим чином зв’язуєтесь з нами.
          </p>

          <div>
            <b>Конфіденційна інформація.</b>
            <p>Ми не обробляємо конфіденційну інформацію.</p>
          </div>

          <div>
            <b>Дані застосунку. </b>
            <p>
              Якщо ви користуєтесь нашим(и) застосунком(ами), ми також можемо
              збирати таку інформацію, якщо ви надаєте нам доступ або дозвіл:
            </p>
          </div>

          <p>
            • Дані мобільного пристрою. Ми автоматично збираємо інформацію про
            пристрій (наприклад, ID мобільного пристрою, модель і виробника),
            інформацію про операційну систему, її версію та конфігурацію,
            ідентифікаційні номери пристрою та застосунку, тип і версію
            браузера, модель обладнання, інтернет-провайдера та/або мобільного
            оператора, а також IP-адресу (або проксі-сервер). Якщо ви
            користуєтесь нашим застосунком(ами), ми також можемо збирати
            інформацію про мережу, пов’язану з вашим мобільним пристроєм,
            операційну систему або платформу пристрою, тип мобільного пристрою,
            його унікальний ID та інформацію про функції застосунку, до яких ви
            отримували доступ.
          </p>
          <p>
            Ця інформація потрібна насамперед для підтримки безпеки та роботи
            наших застосунків, усунення несправностей, а також для внутрішньої
            аналітики та звітності.
          </p>
          <p>
            Уся особиста інформація, яку ви надаєте нам, має бути правдивою,
            повною та точною, і ви повинні повідомляти нас про будь-які зміни
            такої інформації.
          </p>
        </div>
      </div>

      <div>
        <h4>2. ЯК МИ ОБРОБЛЯЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        <div>
          <p>
            Ми обробляємо вашу персональну інформацію з різних причин залежно
            від того, як ви взаємодієте з нашими Сервісами, зокрема:
          </p>
        </div>
      </div>
      <div></div>
      <div></div>
      <div></div>
    </div>
  );
};

export default PrivacyPolicy;
