const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container">
      {/* 1 */}
      <div id="policy-section-1">
        {/* title */}
        <h4>1. ЯКУ ІНФОРМАЦІЮ МИ ЗБИРАЄМО?</h4>
        {/* body */}
        <div className="body">
          <h5>Особиста інформація, яку ви надаєте нам</h5>
          <p>
            Ми збираємо особисту інформацію, яку ви добровільно надаєте нам,
            коли виявляєте зацікавленість у отриманні інформації про нас або
            наші продукти та Послуги, коли берете участь у діяльності в межах
            Послуг або коли іншим чином зв’язуєтесь з нами.
          </p>

          <div style={{ marginTop: 20 }}>
            <h5>Конфіденційна інформація.</h5>
            <p>Ми не обробляємо конфіденційну інформацію.</p>
          </div>

          <div style={{ marginTop: 20 }}>
            <h5>Дані застосунку. </h5>
            <p>
              Якщо ви користуєтесь нашим(и) застосунком(ами), ми також можемо
              збирати таку інформацію, якщо ви надаєте нам доступ або дозвіл:
            </p>
          </div>

          <p>
            • Дані мобільного пристрою. Ми автоматично збираємо інформацію про
            пристрій (наприклад, ID мобільного пристрою, модель і виробника),
            інформацію про операційну систему, її версію та конфігурацію,
            ідентифікаційні номери пристрою та застосунку, тип і версію
            браузера, модель обладнання, інтернет-провайдера та/або мобільного
            оператора, а також IP-адресу (або проксі-сервер). Якщо ви
            користуєтесь нашим застосунком(ами), ми також можемо збирати
            інформацію про мережу, пов’язану з вашим мобільним пристроєм,
            операційну систему або платформу пристрою, тип мобільного пристрою,
            його унікальний ID та інформацію про функції застосунку, до яких ви
            отримували доступ.
          </p>
          <p>
            Ця інформація потрібна насамперед для підтримки безпеки та роботи
            наших застосунків, усунення несправностей, а також для внутрішньої
            аналітики та звітності.
          </p>
          <p>
            Уся особиста інформація, яку ви надаєте нам, має бути правдивою,
            повною та точною, і ви повинні повідомляти нас про будь-які зміни
            такої інформації.
          </p>
        </div>
      </div>

      {/* 2 */}
      <div id="policy-section-2">
        {/* title */}
        <h4>2. ЯК МИ ОБРОБЛЯЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми обробляємо вашу персональну інформацію з різних причин залежно
            від того, як ви взаємодієте з нашими Сервісами, зокрема:
          </p>

          <p>
            •{" "}
            <b>
              Для сприяння створенню облікового запису, автентифікації та
              управлінню обліковими записами користувачів.{" "}
            </b>
            Ми можемо обробляти вашу інформацію, щоб ви могли створити обліковий
            запис, увійти до нього та підтримувати його належну роботу.
          </p>

          <p>
            •{" "}
            <b>
              Для відповіді на запити користувачів / надання підтримки
              користувачам.{" "}
            </b>
            Ми можемо обробляти вашу інформацію, щоб відповідати на ваші запити
            та вирішувати будь-які потенційні проблеми, які можуть виникнути
            щодо запитаної послуги.
          </p>

          <p>
            • <b>Для надсилання вам адміністративної інформації. </b>
            Ми можемо обробляти вашу інформацію, щоб надсилати вам відомості про
            наші продукти та послуги, зміни до наших умов і політик, а також
            іншу подібну інформацію.
          </p>

          <p>
            • <b>Для забезпечення комунікації між користувачами. </b>
            Ми можемо обробляти вашу інформацію, якщо ви вирішите
            використовувати будь-які наші функції, що дозволяють спілкування з
            іншими користувачами.
          </p>

          <p>
            •{" "}
            <b>Для збереження або захисту життєво важливих інтересів особи. </b>
            Ми можемо обробляти вашу інформацію, коли це необхідно для захисту
            ваших життєво важливих інтересів або інтересів іншої особи,
            наприклад для запобігання шкоді.
          </p>
        </div>
      </div>

      {/* 3 */}
      <div id="policy-section-3">
        {/* title */}
        <h4>3. НА ЯКИХ ПРАВОВИХ ПІДСТАВАХ МИ ОБРОБЛЯЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p style={{ textDecoration: "underline" }}>
            Якщо ви перебуваєте в ЄС або Великій Британії, цей розділ стосується
            вас.
          </p>

          <p>
            Загальний регламент захисту даних (GDPR) та GDPR Великої Британії
            вимагають від нас пояснити правові підстави, на які ми спираємося
            для обробки вашої персональної інформації. Відповідно, ми можемо
            покладатися на такі правові підстави для обробки вашої персональної
            інформації:
          </p>

          <p>
            • <b>Згода. </b>
            Ми можемо обробляти вашу інформацію, якщо ви надали нам дозвіл
            (тобто згоду) використовувати вашу персональну інформацію для
            конкретної мети. Ви можете відкликати свою згоду в будь-який час.
            Дізнайтеся більше про те, як відкликати свою згоду.
          </p>

          <p>
            • <b>Виконання договору. </b>
            Ми можемо обробляти вашу персональну інформацію, якщо вважаємо це
            необхідним для виконання наших договірних зобов’язань перед вами,
            включаючи надання наших Сервісів або на ваш запит до укладення
            договору з вами.
          </p>

          <p>
            • <b>Юридичні зобов’язання. </b>
            Ми можемо обробляти вашу інформацію, якщо вважаємо це необхідним для
            дотримання наших юридичних зобов’язань, наприклад для співпраці з
            правоохоронними органами чи регуляторними установами, здійснення або
            захисту наших законних прав або розкриття вашої інформації як доказу
            в судовому процесі, у якому ми беремо участь.
          </p>

          <p>
            • <b>Життєво важливі інтереси. </b>
            Ми можемо обробляти вашу інформацію, якщо вважаємо це необхідним для
            захисту ваших життєво важливих інтересів або життєво важливих
            інтересів третьої сторони, наприклад у ситуаціях, пов’язаних із
            потенційною загрозою безпеці будь-якої особи.
          </p>

          <p className="mt-4 font-bold underline">
            Якщо ви перебуваєте в Канаді, цей розділ застосовується до вас.
          </p>

          <p className="mt-4">
            Ми можемо обробляти вашу інформацію, якщо ви надали нам конкретний
            дозвіл (тобто явну згоду) на використання вашої персональної
            інформації для певної мети, або в ситуаціях, коли ваш дозвіл може
            бути передбачений (тобто неявна згода). Ви можете{" "}
            <a href="#policy-section-9" style={{ textDecoration: "underline" }}>
              відкликати свою згоду (див. “9. ЯКІ У ВАС Є ПРАВА ЩОДО
              КОНФІДЕНЦІЙНОСТІ?”)
            </a>{" "}
            у будь-який час.
          </p>

          <p>
            У деяких виняткових випадках нам може бути законно дозволено
            відповідно до чинного законодавства обробляти вашу інформацію без
            вашої згоди, включаючи, наприклад:
          </p>

          <div>
            <p>
              • Якщо збір інформації явно відповідає інтересам особи, а згоду
              неможливо отримати своєчасно
            </p>

            <p>
              • Для розслідувань, а також виявлення та запобігання шахрайству
            </p>

            <p>• Для ділових операцій за умови виконання певних умов</p>

            <p>
              • Якщо інформація міститься у свідченнях, а її збір необхідний для
              оцінки, обробки або врегулювання страхового випадку
            </p>

            <p>
              • Для ідентифікації поранених, хворих або померлих осіб та зв’язку
              з їхніми найближчими родичами
            </p>

            <p>
              • Якщо у нас є обґрунтовані підстави вважати, що особа була, є або
              може бути жертвою фінансового насильства
            </p>

            <p>
              • Якщо можна обґрунтовано очікувати, що збір і використання
              інформації за згодою може поставити під загрозу доступність або
              точність інформації, а сам збір є обґрунтованим для розслідування
              порушення угоди або порушення законів Канади чи окремої провінції
            </p>

            <p>
              • Якщо розкриття інформації вимагається для виконання повістки,
              ордера, судового наказу або правил суду щодо надання записів
            </p>

            <p>
              • Якщо інформація була створена особою в межах її роботи, бізнесу
              чи професійної діяльності, а збір відповідає цілям, для яких цю
              інформацію було створено
            </p>

            <p>
              • Якщо збір інформації здійснюється виключно для журналістських,
              мистецьких або літературних цілей
            </p>

            <p>
              • Якщо інформація є публічно доступною та визначена нормативними
              актами
            </p>

            <p>
              • Ми можемо розкривати знеособлену інформацію для затверджених
              дослідницьких або статистичних проєктів за умови дотримання
              етичного контролю та зобов’язань щодо конфіденційності
            </p>
          </div>
        </div>
      </div>

      {/* 4 */}
      <div id="policy-section-4">
        {/* title */}
        <h4>4. КОЛИ І З КИМ МИ ДІЛИМОСЯ ВАШОЮ ПЕРСОНАЛЬНОЮ ІНФОРМАЦІЄЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Нам може знадобитися поділитися вашою персональною інформацією в
            таких ситуаціях:
          </p>

          <div className="indent">
            <p>
              • <b>Передача бізнесу. </b>
              Ми можемо ділитися або передавати вашу інформацію у зв’язку з
              будь-яким злиттям, продажем активів компанії, фінансуванням або
              придбанням усієї або частини нашої компанії іншою компанією, а
              також під час переговорів щодо таких процесів.
            </p>

            <p>
              • <b>Інші користувачі. </b>
              Коли ви ділитеся персональною інформацією (наприклад, публікуючи
              коментарі, матеріали чи інший контент у Сервісах) або іншим чином
              взаємодієте з публічними розділами Сервісів, така персональна
              інформація може бути переглянута всіма користувачами та може
              залишатися публічно доступною поза межами Сервісів на необмежений
              термін. Аналогічно, інші користувачі зможуть переглядати опис
              вашої активності, спілкуватися з вами в межах наших Сервісів і
              переглядати ваш профіль.
            </p>
          </div>
        </div>
      </div>

      {/* 5 */}
      <div id="policy-section-5">
        {/* title */}
        <h4>5. ЧИ ПЕРЕДАЄТЬСЯ ВАША ІНФОРМАЦІЯ НА МІЖНАРОДНОМУ РІВНІ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Наші сервери розташовані у Сполучених Штатах. Незалежно від вашого
            місцезнаходження, будь ласка, майте на увазі, що ваша інформація
            може передаватися, зберігатися та оброблятися нами у наших власних
            установах, а також у установах третіх сторін, з якими ми можемо
            ділитися вашою персональною інформацією (див. розділ “4. КОЛИ І З
            КИМ МИ ДІЛИМОСЯ ВАШОЮ ПЕРСОНАЛЬНОЮ ІНФОРМАЦІЄЮ?” вище), включаючи
            установи в інших країнах.
          </p>

          <p>
            Якщо ви є резидентом Європейської економічної зони (EEA), Великої
            Британії (UK) або Швейцарії, у цих країнах можуть не діяти закони
            про захист даних чи інші подібні закони, настільки ж всеосяжні, як у
            вашій країні. Однак ми вживатимемо всіх необхідних заходів для
            захисту вашої персональної інформації відповідно до цього
            Повідомлення про конфіденційність та чинного законодавства.
          </p>
        </div>
      </div>

      {/* 6 */}
      <div id="policy-section-6">
        {/* title */}
        <h4>6. ЯК ДОВГО МИ ЗБЕРІГАЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми зберігатимемо вашу персональну інформацію лише стільки часу,
            скільки це необхідно для досягнення цілей, викладених у цьому
            Повідомленні про конфіденційність, якщо довший період зберігання не
            вимагається або не дозволяється законом (наприклад, податковими,
            бухгалтерськими чи іншими юридичними вимогами). Жодна з цілей,
            зазначених у цьому повідомленні, не вимагатиме від нас зберігати
            вашу персональну інформацію довше, ніж період, протягом якого у вас
            є обліковий запис у нас.
          </p>

          <p>
            Коли у нас більше не буде законної бізнес-потреби обробляти вашу
            персональну інформацію, ми або видалимо, або анонімізуємо таку
            інформацію, або, якщо це неможливо (наприклад, через те, що ваша
            персональна інформація зберігається в резервних архівах), ми
            безпечно зберігатимемо вашу персональну інформацію та ізолюємо її
            від будь-якої подальшої обробки до моменту, коли видалення стане
            можливим.
          </p>
        </div>
      </div>

      {/* 7 */}
      <div id="policy-section-7">
        {/* title */}
        <h4>7. ЯК МИ ЗАХИЩАЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми впровадили відповідні та обґрунтовані технічні й організаційні
            заходи безпеки, спрямовані на захист будь-якої персональної
            інформації, яку ми обробляємо. Однак, незважаючи на наші заходи
            безпеки та зусилля щодо захисту вашої інформації, жодна електронна
            передача даних через Інтернет або технологія зберігання інформації
            не може бути гарантовано на 100% безпечною. Тому ми не можемо
            обіцяти або гарантувати, що хакери, кіберзлочинці чи інші
            неавторизовані треті сторони не зможуть обійти наші заходи безпеки
            та неправомірно зібрати, отримати доступ, викрасти або змінити вашу
            інформацію. Хоча ми робитимемо все можливе для захисту вашої
            персональної інформації, передача персональної інформації до та з
            наших Сервісів здійснюється на ваш власний ризик. Ви повинні
            користуватися Сервісами лише в безпечному середовищі.
          </p>
        </div>
      </div>

      {/* 8 */}
      <div id="policy-section-8">
        {/* title */}
        <h4>8. ЧИ ЗБИРАЄМО МИ ІНФОРМАЦІЮ ВІД НЕПОВНОЛІТНІХ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми свідомо не збираємо, не запитуємо дані та не здійснюємо маркетинг
            для дітей віком до 18 років або іншого мінімального віку,
            встановленого законодавством вашої юрисдикції, а також не продаємо
            таку персональну інформацію. Користуючись Сервісами, ви
            підтверджуєте, що вам виповнилося щонайменше 18 років або інший
            мінімальний вік, встановлений законодавством вашої юрисдикції, або
            що ви є батьком, матір’ю чи законним опікуном такої неповнолітньої
            особи та погоджуєтесь на використання Сервісів такою особою. Якщо ми
            дізнаємося, що була зібрана персональна інформація користувачів
            молодше 18 років або іншого мінімального віку, встановленого
            законодавством вашої юрисдикції, ми деактивуємо обліковий запис та
            вживемо розумних заходів для негайного видалення таких даних з наших
            записів. Якщо вам стане відомо про будь-які дані, які ми могли
            зібрати від дітей молодше 18 років або іншого мінімального віку,
            встановленого законодавством вашої юрисдикції, будь ласка,
            зв’яжіться з нами за адресою{" "}
            <span style={{ textDecoration: "underline" }}>
              wordfortodaycontact@gmail.com
            </span>
            .
          </p>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicy;
