import { useRef } from "react";

const PrivacyPolicy = () => {
  const sectionRefs = useRef([]);

  const scrollToSection = (index) => {
    sectionRefs.current[index]?.scrollIntoView({ behavior: "smooth" });
  };

  return (
    <div className="policy-container">
      {/* 1 */}
      <div ref={(el) => (sectionRefs.current[0] = el)}>
        {/* title */}
        <h4>1. ЯКУ ІНФОРМАЦІЮ МИ ЗБИРАЄМО?</h4>
        {/* body */}
        <div className="body">
          <h5>Особиста інформація, яку ви надаєте нам</h5>
          <p>
            Ми збираємо особисту інформацію, яку ви добровільно надаєте нам,
            коли виявляєте зацікавленість у отриманні інформації про нас або
            наші продукти та Послуги, коли берете участь у діяльності в межах
            Послуг або коли іншим чином зв’язуєтесь з нами.
          </p>

          <div style={{ marginTop: 20 }}>
            <h5>Конфіденційна інформація.</h5>
            <p>Ми не обробляємо конфіденційну інформацію.</p>
          </div>

          <div style={{ marginTop: 20 }}>
            <h5>Дані застосунку. </h5>
            <p>
              Якщо ви користуєтесь нашим(и) застосунком(ами), ми також можемо
              збирати таку інформацію, якщо ви надаєте нам доступ або дозвіл:
            </p>
          </div>

          <p>
            • Дані мобільного пристрою. Ми автоматично збираємо інформацію про
            пристрій (наприклад, ID мобільного пристрою, модель і виробника),
            інформацію про операційну систему, її версію та конфігурацію,
            ідентифікаційні номери пристрою та застосунку, тип і версію
            браузера, модель обладнання, інтернет-провайдера та/або мобільного
            оператора, а також IP-адресу (або проксі-сервер). Якщо ви
            користуєтесь нашим застосунком(ами), ми також можемо збирати
            інформацію про мережу, пов’язану з вашим мобільним пристроєм,
            операційну систему або платформу пристрою, тип мобільного пристрою,
            його унікальний ID та інформацію про функції застосунку, до яких ви
            отримували доступ.
          </p>
          <p>
            Ця інформація потрібна насамперед для підтримки безпеки та роботи
            наших застосунків, усунення несправностей, а також для внутрішньої
            аналітики та звітності.
          </p>
          <p>
            Уся особиста інформація, яку ви надаєте нам, має бути правдивою,
            повною та точною, і ви повинні повідомляти нас про будь-які зміни
            такої інформації.
          </p>
        </div>
      </div>

      {/* 2 */}
      <div ref={(el) => (sectionRefs.current[1] = el)}>
        {/* title */}
        <h4>2. ЯК МИ ОБРОБЛЯЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми обробляємо вашу персональну інформацію з різних причин залежно
            від того, як ви взаємодієте з нашими Сервісами, зокрема:
          </p>

          <p>
            •{" "}
            <b>
              Для сприяння створенню облікового запису, автентифікації та
              управлінню обліковими записами користувачів.{" "}
            </b>
            Ми можемо обробляти вашу інформацію, щоб ви могли створити обліковий
            запис, увійти до нього та підтримувати його належну роботу.
          </p>

          <p>
            •{" "}
            <b>
              Для відповіді на запити користувачів / надання підтримки
              користувачам.{" "}
            </b>
            Ми можемо обробляти вашу інформацію, щоб відповідати на ваші запити
            та вирішувати будь-які потенційні проблеми, які можуть виникнути
            щодо запитаної послуги.
          </p>

          <p>
            • <b>Для надсилання вам адміністративної інформації. </b>
            Ми можемо обробляти вашу інформацію, щоб надсилати вам відомості про
            наші продукти та послуги, зміни до наших умов і політик, а також
            іншу подібну інформацію.
          </p>

          <p>
            • <b>Для забезпечення комунікації між користувачами. </b>
            Ми можемо обробляти вашу інформацію, якщо ви вирішите
            використовувати будь-які наші функції, що дозволяють спілкування з
            іншими користувачами.
          </p>

          <p>
            •{" "}
            <b>Для збереження або захисту життєво важливих інтересів особи. </b>
            Ми можемо обробляти вашу інформацію, коли це необхідно для захисту
            ваших життєво важливих інтересів або інтересів іншої особи,
            наприклад для запобігання шкоді.
          </p>
        </div>
      </div>

      {/* 3 */}
      <div ref={(el) => (sectionRefs.current[2] = el)}>
        {/* title */}
        <h4>3. НА ЯКИХ ПРАВОВИХ ПІДСТАВАХ МИ ОБРОБЛЯЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p style={{ textDecoration: "underline" }}>
            Якщо ви перебуваєте в ЄС або Великій Британії, цей розділ стосується
            вас.
          </p>

          <p>
            Загальний регламент захисту даних (GDPR) та GDPR Великої Британії
            вимагають від нас пояснити правові підстави, на які ми спираємося
            для обробки вашої персональної інформації. Відповідно, ми можемо
            покладатися на такі правові підстави для обробки вашої персональної
            інформації:
          </p>

          <p>
            • <b>Згода. </b>
            Ми можемо обробляти вашу інформацію, якщо ви надали нам дозвіл
            (тобто згоду) використовувати вашу персональну інформацію для
            конкретної мети. Ви можете відкликати свою згоду в будь-який час.
            Дізнайтеся більше про те, як відкликати свою згоду.
          </p>

          <p>
            • <b>Виконання договору. </b>
            Ми можемо обробляти вашу персональну інформацію, якщо вважаємо це
            необхідним для виконання наших договірних зобов’язань перед вами,
            включаючи надання наших Сервісів або на ваш запит до укладення
            договору з вами.
          </p>

          <p>
            • <b>Юридичні зобов’язання. </b>
            Ми можемо обробляти вашу інформацію, якщо вважаємо це необхідним для
            дотримання наших юридичних зобов’язань, наприклад для співпраці з
            правоохоронними органами чи регуляторними установами, здійснення або
            захисту наших законних прав або розкриття вашої інформації як доказу
            в судовому процесі, у якому ми беремо участь.
          </p>

          <p>
            • <b>Життєво важливі інтереси. </b>
            Ми можемо обробляти вашу інформацію, якщо вважаємо це необхідним для
            захисту ваших життєво важливих інтересів або життєво важливих
            інтересів третьої сторони, наприклад у ситуаціях, пов’язаних із
            потенційною загрозою безпеці будь-якої особи.
          </p>

          <b style={{ textDecoration: "underline" }}>
            Якщо ви перебуваєте в Канаді, цей розділ застосовується до вас.
          </b>

          <p>
            Ми можемо обробляти вашу інформацію, якщо ви надали нам конкретний
            дозвіл (тобто явну згоду) на використання вашої персональної
            інформації для певної мети, або в ситуаціях, коли ваш дозвіл може
            бути передбачений (тобто неявна згода). Ви можете{" "}
            <PageInnerLink scrollTo={scrollToSection} index={8}>
              відкликати свою згоду (див. “9. ЯКІ У ВАС Є ПРАВА ЩОДО
              КОНФІДЕНЦІЙНОСТІ?”)
            </PageInnerLink>{" "}
            у будь-який час.
          </p>

          <p>
            У деяких виняткових випадках нам може бути законно дозволено
            відповідно до чинного законодавства обробляти вашу інформацію без
            вашої згоди, включаючи, наприклад:
          </p>

          <div>
            <p>
              • Якщо збір інформації явно відповідає інтересам особи, а згоду
              неможливо отримати своєчасно
            </p>

            <p>
              • Для розслідувань, а також виявлення та запобігання шахрайству
            </p>

            <p>• Для ділових операцій за умови виконання певних умов</p>

            <p>
              • Якщо інформація міститься у свідченнях, а її збір необхідний для
              оцінки, обробки або врегулювання страхового випадку
            </p>

            <p>
              • Для ідентифікації поранених, хворих або померлих осіб та зв’язку
              з їхніми найближчими родичами
            </p>

            <p>
              • Якщо у нас є обґрунтовані підстави вважати, що особа була, є або
              може бути жертвою фінансового насильства
            </p>

            <p>
              • Якщо можна обґрунтовано очікувати, що збір і використання
              інформації за згодою може поставити під загрозу доступність або
              точність інформації, а сам збір є обґрунтованим для розслідування
              порушення угоди або порушення законів Канади чи окремої провінції
            </p>

            <p>
              • Якщо розкриття інформації вимагається для виконання повістки,
              ордера, судового наказу або правил суду щодо надання записів
            </p>

            <p>
              • Якщо інформація була створена особою в межах її роботи, бізнесу
              чи професійної діяльності, а збір відповідає цілям, для яких цю
              інформацію було створено
            </p>

            <p>
              • Якщо збір інформації здійснюється виключно для журналістських,
              мистецьких або літературних цілей
            </p>

            <p>
              • Якщо інформація є публічно доступною та визначена нормативними
              актами
            </p>

            <p>
              • Ми можемо розкривати знеособлену інформацію для затверджених
              дослідницьких або статистичних проєктів за умови дотримання
              етичного контролю та зобов’язань щодо конфіденційності
            </p>
          </div>
        </div>
      </div>

      {/* 4 */}
      <div ref={(el) => (sectionRefs.current[3] = el)}>
        {/* title */}
        <h4>4. КОЛИ І З КИМ МИ ДІЛИМОСЯ ВАШОЮ ПЕРСОНАЛЬНОЮ ІНФОРМАЦІЄЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Нам може знадобитися поділитися вашою персональною інформацією в
            таких ситуаціях:
          </p>

          <div className="indent">
            <p>
              • <b>Передача бізнесу. </b>
              Ми можемо ділитися або передавати вашу інформацію у зв’язку з
              будь-яким злиттям, продажем активів компанії, фінансуванням або
              придбанням усієї або частини нашої компанії іншою компанією, а
              також під час переговорів щодо таких процесів.
            </p>

            <p>
              • <b>Інші користувачі. </b>
              Коли ви ділитеся персональною інформацією (наприклад, публікуючи
              коментарі, матеріали чи інший контент у Сервісах) або іншим чином
              взаємодієте з публічними розділами Сервісів, така персональна
              інформація може бути переглянута всіма користувачами та може
              залишатися публічно доступною поза межами Сервісів на необмежений
              термін. Аналогічно, інші користувачі зможуть переглядати опис
              вашої активності, спілкуватися з вами в межах наших Сервісів і
              переглядати ваш профіль.
            </p>
          </div>
        </div>
      </div>

      {/* 5 */}
      <div ref={(el) => (sectionRefs.current[4] = el)}>
        {/* title */}
        <h4>5. ЧИ ПЕРЕДАЄТЬСЯ ВАША ІНФОРМАЦІЯ НА МІЖНАРОДНОМУ РІВНІ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Наші сервери розташовані у Сполучених Штатах. Незалежно від вашого
            місцезнаходження, будь ласка, майте на увазі, що ваша інформація
            може передаватися, зберігатися та оброблятися нами у наших власних
            установах, а також у установах третіх сторін, з якими ми можемо
            ділитися вашою персональною інформацією (див. розділ “4. КОЛИ І З
            КИМ МИ ДІЛИМОСЯ ВАШОЮ ПЕРСОНАЛЬНОЮ ІНФОРМАЦІЄЮ?” вище), включаючи
            установи в інших країнах.
          </p>

          <p>
            Якщо ви є резидентом Європейської економічної зони (EEA), Великої
            Британії (UK) або Швейцарії, у цих країнах можуть не діяти закони
            про захист даних чи інші подібні закони, настільки ж всеосяжні, як у
            вашій країні. Однак ми вживатимемо всіх необхідних заходів для
            захисту вашої персональної інформації відповідно до цього
            Повідомлення про конфіденційність та чинного законодавства.
          </p>
        </div>
      </div>

      {/* 6 */}
      <div ref={(el) => (sectionRefs.current[5] = el)}>
        {/* title */}
        <h4>6. ЯК ДОВГО МИ ЗБЕРІГАЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми зберігатимемо вашу персональну інформацію лише стільки часу,
            скільки це необхідно для досягнення цілей, викладених у цьому
            Повідомленні про конфіденційність, якщо довший період зберігання не
            вимагається або не дозволяється законом (наприклад, податковими,
            бухгалтерськими чи іншими юридичними вимогами). Жодна з цілей,
            зазначених у цьому повідомленні, не вимагатиме від нас зберігати
            вашу персональну інформацію довше, ніж період, протягом якого у вас
            є обліковий запис у нас.
          </p>

          <p>
            Коли у нас більше не буде законної бізнес-потреби обробляти вашу
            персональну інформацію, ми або видалимо, або анонімізуємо таку
            інформацію, або, якщо це неможливо (наприклад, через те, що ваша
            персональна інформація зберігається в резервних архівах), ми
            безпечно зберігатимемо вашу персональну інформацію та ізолюємо її
            від будь-якої подальшої обробки до моменту, коли видалення стане
            можливим.
          </p>
        </div>
      </div>

      {/* 7 */}
      <div ref={(el) => (sectionRefs.current[6] = el)}>
        {/* title */}
        <h4>7. ЯК МИ ЗАХИЩАЄМО ВАШУ ІНФОРМАЦІЮ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми впровадили відповідні та обґрунтовані технічні й організаційні
            заходи безпеки, спрямовані на захист будь-якої персональної
            інформації, яку ми обробляємо. Однак, незважаючи на наші заходи
            безпеки та зусилля щодо захисту вашої інформації, жодна електронна
            передача даних через Інтернет або технологія зберігання інформації
            не може бути гарантовано на 100% безпечною. Тому ми не можемо
            обіцяти або гарантувати, що хакери, кіберзлочинці чи інші
            неавторизовані треті сторони не зможуть обійти наші заходи безпеки
            та неправомірно зібрати, отримати доступ, викрасти або змінити вашу
            інформацію. Хоча ми робитимемо все можливе для захисту вашої
            персональної інформації, передача персональної інформації до та з
            наших Сервісів здійснюється на ваш власний ризик. Ви повинні
            користуватися Сервісами лише в безпечному середовищі.
          </p>
        </div>
      </div>

      {/* 8 */}
      <div ref={(el) => (sectionRefs.current[7] = el)}>
        {/* title */}
        <h4>8. ЧИ ЗБИРАЄМО МИ ІНФОРМАЦІЮ ВІД НЕПОВНОЛІТНІХ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми свідомо не збираємо, не запитуємо дані та не здійснюємо маркетинг
            для дітей віком до 18 років або іншого мінімального віку,
            встановленого законодавством вашої юрисдикції, а також не продаємо
            таку персональну інформацію. Користуючись Сервісами, ви
            підтверджуєте, що вам виповнилося щонайменше 18 років або інший
            мінімальний вік, встановлений законодавством вашої юрисдикції, або
            що ви є батьком, матір’ю чи законним опікуном такої неповнолітньої
            особи та погоджуєтесь на використання Сервісів такою особою. Якщо ми
            дізнаємося, що була зібрана персональна інформація користувачів
            молодше 18 років або іншого мінімального віку, встановленого
            законодавством вашої юрисдикції, ми деактивуємо обліковий запис та
            вживемо розумних заходів для негайного видалення таких даних з наших
            записів. Якщо вам стане відомо про будь-які дані, які ми могли
            зібрати від дітей молодше 18 років або іншого мінімального віку,
            встановленого законодавством вашої юрисдикції, будь ласка,
            зв’яжіться з нами за адресою{" "}
            <span style={{ textDecoration: "underline" }}>
              wordfortodaycontact@gmail.com
            </span>
            .
          </p>
        </div>
      </div>

      {/* 9 */}
      <div ref={(el) => (sectionRefs.current[8] = el)}>
        {/* title */}
        <h4>9. ЯКІ У ВАС Є ПРАВА ЩОДО КОНФІДЕНЦІЙНОСТІ?</h4>
        {/* body */}
        <div className="body">
          <p>
            У деяких регіонах (таких як ЄЕЗ, Велика Британія, Швейцарія та
            Канада) ви маєте певні права відповідно до чинного законодавства про
            захист даних. Вони можуть включати право: (i) запитувати доступ та
            отримувати копію вашої персональної інформації; (ii) вимагати
            виправлення або видалення; (iii) обмежувати обробку вашої
            персональної інформації; (iv) за наявності відповідних умов —
            переносити дані; та (v) не підлягати автоматизованому прийняттю
            рішень. Якщо рішення, яке має юридичні або подібні суттєві наслідки,
            приймається виключно автоматизованими засобами, ми повідомимо вас,
            пояснимо основні фактори та запропонуємо простий спосіб запросити
            перевірку людиною. За певних обставин ви також можете мати право
            заперечувати проти обробки вашої персональної інформації. Ви можете
            подати такий запит, зв’язавшись з нами за контактними даними,
            наведеними в розділі “
            <PageInnerLink scrollTo={scrollToSection} index={13}>
              14. ЯК ВИ МОЖЕТЕ ЗВ’ЯЗАТИСЯ З НАМИ ЩОДО ЦЬОГО ПОВІДОМЛЕННЯ?
            </PageInnerLink>
            ” нижче.
          </p>

          <p>
            Ми розглядатимемо та виконуватимемо будь-які запити відповідно до
            чинного законодавства про захист даних.
          </p>

          <p>
            Якщо ви перебуваєте в ЄЕЗ або Великій Британії та вважаєте, що ми
            незаконно обробляємо вашу персональну інформацію, ви також маєте
            право подати скаргу до{" "}
            <span style={{ textDecoration: "underline" }}>
              органу захисту даних вашої держави-члена
            </span>{" "}
            або{" "}
            <span style={{ textDecoration: "underline" }}>
              органу захисту даних Великої Британії
            </span>
            .
          </p>

          <p>
            Якщо ви перебуваєте у Швейцарії, ви можете звернутися до{" "}
            <span style={{ textDecoration: "underline" }}>
              Федерального уповноваженого із захисту даних та інформації
            </span>
            .
          </p>

          <p>
            <b style={{ textDecoration: "underline" }}>
              Відкликання вашої згоди:
            </b>{" "}
            Якщо ми покладаємося на вашу згоду для обробки вашої персональної
            інформації, яка може бути явно або неявно наданою залежно від
            чинного законодавства, ви маєте право відкликати свою згоду в
            будь-який час. Ви можете відкликати свою згоду в будь-який час,
            зв’язавшись з нами за контактними даними, наведеними в розділі “
            <PageInnerLink scrollTo={scrollToSection} index={13}>
              14. ЯК ВИ МОЖЕТЕ ЗВ’ЯЗАТИСЯ З НАМИ ЩОДО ЦЬОГО ПОВІДОМЛЕННЯ?
            </PageInnerLink>
            ” нижче.
          </p>

          <p>
            Однак зверніть увагу, що це не вплине на законність обробки,
            здійсненої до відкликання згоди, а також, якщо це дозволено чинним
            законодавством, не вплине на обробку вашої персональної інформації,
            що здійснюється на інших законних підставах, окрім згоди.
          </p>

          <h5>Інформація про обліковий запис</h5>

          <p>
            Якщо ви в будь-який момент захочете переглянути або змінити
            інформацію у своєму обліковому записі чи видалити свій обліковий
            запис, ви можете:
          </p>

          <p className="indent">
            • Увійти в налаштування свого облікового запису та оновити
            інформацію користувача.
          </p>

          <p>
            Після вашого запиту на видалення облікового запису ми деактивуємо
            або видалимо ваш обліковий запис та інформацію з наших активних баз
            даних. Однак ми можемо зберігати певну інформацію у наших файлах для
            запобігання шахрайству, усунення проблем, допомоги у розслідуваннях,
            забезпечення виконання наших юридичних умов та/або дотримання чинних
            законодавчих вимог.
          </p>
        </div>
      </div>

      {/* 10 */}
      <div ref={(el) => (sectionRefs.current[9] = el)}>
        {/* title */}
        <h4>10. КОНТРОЛЬ ФУНКЦІЙ DO-NOT-TRACK"</h4>
        {/* body */}
        <div className="body">
          <p>
            Більшість веббраузерів, а також деякі мобільні операційні системи та
            мобільні додатки містять функцію або налаштування Do-Not-Track
            (“DNT”), яке ви можете активувати, щоб повідомити про своє бажання
            не дозволяти моніторинг і збір даних про вашу онлайн-активність. На
            даний момент не існує єдиного технологічного стандарту для
            розпізнавання та реалізації сигналів DNT. Тому ми наразі не реагуємо
            на сигнали DNT браузерів або будь-які інші механізми, які
            автоматично повідомляють про ваш вибір не бути відстежуваним онлайн.
            Якщо в майбутньому буде прийнято стандарт онлайн-відстеження, якого
            ми повинні будемо дотримуватися, ми повідомимо вас про це в
            оновленій версії цього Повідомлення про конфіденційність.
          </p>

          <p>
            Законодавство Каліфорнії вимагає від нас повідомити вам, як ми
            реагуємо на сигнали DNT веббраузерів. Оскільки наразі не існує
            галузевого чи юридичного стандарту для розпізнавання або дотримання
            сигналів DNT, ми наразі не реагуємо на них.
          </p>
        </div>
      </div>

      {/* 11 */}
      <div ref={(el) => (sectionRefs.current[10] = el)}>
        {/* title */}
        <h4>
          11. ЧИ МАЮТЬ ЖИТЕЛІ СПОЛУЧЕНИХ ШТАТІВ СПЕЦІАЛЬНІ ПРАВА ЩОДО
          КОНФІДЕНЦІЙНОСТІ?
        </h4>
        {/* body */}
        <div className="body">
          <h5>"Категорії персональної інформації, яку ми збираємо"</h5>

          <p>
            Таблиця нижче показує категорії персональної інформації, яку ми
            збирали протягом останніх дванадцяти (12) місяців. Таблиця містить
            ілюстративні приклади для кожної категорії та не відображає всю
            персональну інформацію, яку ми збираємо від вас. Для повного
            переліку всієї персональної інформації, яку ми обробляємо, будь
            ласка, зверніться до розділу “
            <PageInnerLink scrollTo={scrollToSection} index={0}>
              1. ЯКУ ІНФОРМАЦІЮ МИ ЗБИРАЄМО?
            </PageInnerLink>
            ”
          </p>

          <h5>{"Джерела персональної інформації"}</h5>

          <p>
            Дізнайтеся більше про джерела персональної інформації, яку ми
            збираємо, у розділі “
            <PageInnerLink scrollTo={scrollToSection} index={0}>
              1. ЯКУ ІНФОРМАЦІЮ МИ ЗБИРАЄМО?
            </PageInnerLink>
            ”
          </p>

          <h5>Як ми використовуємо та поширюємо персональну інформацію</h5>

          <p>
            Дізнайтеся більше про те, як ми використовуємо вашу персональну
            інформацію, у розділі “
            <PageInnerLink scrollTo={scrollToSection} index={1}>
              2. ЯК МИ ОБРОБЛЯЄМО ВАШУ ІНФОРМАЦІЮ?
            </PageInnerLink>
            ”
          </p>

          <b>Чи буде ваша інформація передана будь-кому іншому?</b>

          <p>
            Ми можемо розкривати вашу персональну інформацію нашим
            постачальникам послуг відповідно до письмового договору між нами та
            кожним постачальником послуг. Дізнайтеся більше про те, як ми
            розкриваємо персональну інформацію, у розділі “
            <PageInnerLink scrollTo={scrollToSection} index={3}>
              4. КОЛИ І З КИМ МИ ДІЛИМОСЯ ВАШОЮ ПЕРСОНАЛЬНОЮ ІНФОРМАЦІЄЮ?
            </PageInnerLink>
            ”
          </p>

          <p>
            Ми можемо використовувати вашу персональну інформацію для власних
            бізнес-цілей, наприклад для проведення внутрішніх досліджень з
            технологічного розвитку та демонстрації. Це не вважається “продажем”
            вашої персональної інформації.
          </p>

          <p>
            Протягом попередніх дванадцяти (12) місяців ми не розкривали, не
            продавали та не передавали жодної персональної інформації третім
            сторонам для бізнесових або комерційних цілей. Ми також не будемо
            продавати або передавати в майбутньому персональну інформацію, що
            належить відвідувачам вебсайту, користувачам та іншим споживачам.
          </p>

          <h5>Ваші права</h5>

          <p>
            Ви маєте права відповідно до певних законів штатів США про захист
            даних. Однак ці права не є абсолютними, і в деяких випадках ми
            можемо відхилити ваш запит у випадках, дозволених законом. Ці права
            включають:
          </p>

          <div className="indent">
            <p>
              • <b>Право знати</b>, чи обробляємо ми ваші персональні дані
            </p>

            <p>
              • <b>Право на доступ</b> до ваших персональних даних
            </p>

            <p>
              • <b>Право на виправлення</b> неточностей у ваших персональних
              даних
            </p>

            <p>
              • <b>Право вимагати</b> видалення ваших персональних даних
            </p>

            <p>
              • <b>Право отримати копію</b> персональних даних, які ви раніше
              надали нам
            </p>

            <p>
              • <b>Право на недискримінацію</b> за здійснення ваших прав
            </p>

            <p>
              • <b>Право відмовитися</b> від обробки ваших персональних даних,
              якщо вони використовуються для таргетованої реклами (або
              передаються відповідно до законодавства Каліфорнії про
              конфіденційність), продажу персональних даних або профілювання з
              метою прийняття рішень, які мають юридичні чи подібні суттєві
              наслідки (“профілювання”)
            </p>
          </div>

          <p>
            Залежно від штату, у якому ви проживаєте, ви також можете мати такі
            права:
          </p>

          <div className="indent">
            <p>
              • Право на доступ до категорій персональних даних, що обробляються
              (як дозволено чинним законодавством, включаючи законодавство про
              конфіденційність у Міннесоті)
            </p>

            <p>
              • Право отримати список категорій третіх сторін, яким ми розкрили
              персональні дані (як дозволено чинним законодавством, включаючи
              законодавство про конфіденційність у Каліфорнії, Делавері та
              Меріленді)
            </p>

            <p>
              • Право отримати список конкретних третіх сторін, яким ми розкрили
              персональні дані (як дозволено чинним законодавством, включаючи
              законодавство про конфіденційність у Міннесоті та Орегоні)
            </p>

            <p>
              • Право отримати список третіх сторін, яким ми продали персональні
              дані (як дозволено чинним законодавством, включаючи законодавство
              про конфіденційність у Коннектикуті)
            </p>

            <p>
              • Право переглядати, розуміти, ставити під сумнів та, залежно від
              місця вашого проживання, виправляти спосіб профілювання
              персональних даних (як дозволено чинним законодавством, включаючи
              законодавство про конфіденційність у Коннектикуті та Міннесоті)
            </p>

            <p>
              • Право обмежувати використання та розкриття чутливих персональних
              даних (як дозволено чинним законодавством, включаючи законодавство
              про конфіденційність у Каліфорнії)
            </p>

            <p>
              • Право відмовитися від збору чутливих даних та персональних
              даних, зібраних через функції голосового або розпізнавання обличчя
              (як дозволено чинним законодавством, включаючи законодавство про
              конфіденційність у Флориді)
            </p>
          </div>

          <h5>Як реалізувати свої права</h5>

          <p>
            Щоб скористатися цими правами, ви можете зв’язатися з нами
            електронною поштою за адресою wordfortodaycontact@gmail.com або
            скористатися контактною інформацією, наведеною внизу цього
            документа.
          </p>

          <p>
            Відповідно до певних законів штатів США про захист даних, ви можете
            призначити уповноваженого представника для подання запиту від вашого
            імені. Ми можемо відхилити запит від уповноваженого представника,
            якщо не буде надано підтвердження того, що він був належним чином
            уповноважений діяти від вашого імені відповідно до чинного
            законодавства.
          </p>

          <h5>Перевірка запиту</h5>

          <p>
            Після отримання вашого запиту нам потрібно буде перевірити вашу
            особу, щоб підтвердити, що ви є тією самою особою, інформацію про
            яку ми маємо у нашій системі. Ми використовуватимемо персональну
            інформацію, надану у вашому запиті, лише для підтвердження вашої
            особи або повноважень на подання запиту. Однак, якщо ми не зможемо
            підтвердити вашу особу на основі вже наявної у нас інформації, ми
            можемо попросити вас надати додаткову інформацію з метою
            підтвердження вашої особи та для забезпечення безпеки або
            запобігання шахрайству.
          </p>

          <p>
            Якщо ви подаєте запит через уповноваженого представника, нам може
            знадобитися зібрати додаткову інформацію для підтвердження вашої
            особи перед обробкою запиту, а представник повинен буде надати
            письмовий та підписаний дозвіл від вас на подання такого запиту від
            вашого імені.
          </p>

          <h5>Скарги та апеляції</h5>
          <p>
            Відповідно до певних законів штатів США про захист персональних
            даних, якщо ми відмовимося вживати заходів щодо вашого запиту, ви
            можете оскаржити наше рішення, надіславши електронний лист на адресу
            wordfortodaycontact@gmail.com. Ми письмово повідомимо вас про
            будь-які дії, вжиті або не вжиті у відповідь на апеляцію, включаючи
            письмове пояснення причин прийнятого рішення. Якщо вашу апеляцію
            буде відхилено, ви можете подати скаргу генеральному прокурору
            вашого штату.
          </p>

          <h5>Закон Каліфорнії “Shine The Light”</h5>
          <p>
            Розділ 1798.83 Цивільного кодексу Каліфорнії, також відомий як закон
            &apos;Shine The Light&apos;, дозволяє нашим користувачам, які є
            жителями Каліфорнії, один раз на рік і безкоштовно запитувати та
            отримувати від нас інформацію про категорії персональної інформації
            (якщо така є), яку ми розкривали третім сторонам для цілей прямого
            маркетингу, а також імена та адреси всіх третіх сторін, з якими ми
            ділилися персональною інформацією протягом попереднього календарного
            року. Якщо ви є жителем Каліфорнії та бажаєте подати такий запит,
            будь ласка, надішліть його нам у письмовій формі, використовуючи
            контактні дані, наведені в розділі “
            <PageInnerLink scrollTo={scrollToSection} index={13}>
              14. ЯК ВИ МОЖЕТЕ ЗВ’ЯЗАТИСЯ З НАМИ ЩОДО ЦЬОГО ПОВІДОМЛЕННЯ?
            </PageInnerLink>
            ”
          </p>
        </div>
      </div>

      {/* 12 */}
      <div ref={(el) => (sectionRefs.current[11] = el)}>
        {/* title */}
        <h4>
          12. ЧИ МАЮТЬ ІНШІ РЕГІОНИ СПЕЦИФІЧНІ ПРАВА ЩОДО КОНФІДЕНЦІЙНОСТІ?
        </h4>
        {/* body */}
        <div className="body">
          <h5>Австралія та Нова Зеландія</h5>
          <p>
            Ми збираємо та обробляємо вашу персональну інформацію відповідно до
            зобов’язань і умов, встановлених Законом Австралії про
            конфіденційність 1988 року та Законом Нової Зеландії про
            конфіденційність 2020 року (Privacy Act).
          </p>

          <p>
            Це Повідомлення про конфіденційність відповідає вимогам щодо
            повідомлень, визначеним в обох Законах про конфіденційність, зокрема
            щодо того, яку персональну інформацію ми збираємо від вас, з яких
            джерел, для яких цілей, а також кому може бути передана ваша
            персональна інформація.
          </p>

          <p>
            Якщо ви не бажаєте надавати персональну інформацію, необхідну для
            досягнення відповідної мети, це може вплинути на нашу здатність
            надавати вам наші послуги, зокрема:
          </p>

          <div className="indent">
            <p>• надавати вам продукти або послуги, які ви бажаєте отримати</p>
            <p>• відповідати на ваші запити або допомагати вам</p>
            <p>• керувати вашим обліковим записом у нас</p>
            <p>• підтверджувати вашу особу та захищати ваш обліковий запис</p>
          </div>

          <p>
            У будь-який час ви маєте право запросити доступ до вашої
            персональної інформації або її виправлення. Ви можете подати такий
            запит, зв’язавшись із нами за контактними даними, наведеними в
            розділі “
            <PageInnerLink scrollTo={scrollToSection} index={14}>
              15. ЯК ВИ МОЖЕТЕ ПЕРЕГЛЯНУТИ, ОНОВИТИ АБО ВИДАЛИТИ ДАНІ, ЯКІ МИ
              ЗБИРАЄМО ПРО ВАС?
            </PageInnerLink>
            ”
          </p>

          <p>
            Якщо ви вважаєте, що ми незаконно обробляємо вашу персональну
            інформацію, ви маєте право подати скаргу щодо порушення
            Австралійських принципів конфіденційності до{" "}
            <span style={{ textDecoration: "underline" }}>
              Office of the Australian Information Commissioner
            </span>{" "}
            та щодо порушення Принципів конфіденційності Нової Зеландії до{" "}
            <span style={{ textDecoration: "underliner" }}>
              Office of New Zealand Privacy Commissioner
            </span>
            .
          </p>

          <h5>{"Південно-Африканська Республіка"}</h5>

          <p>
            У будь-який час ви маєте право запросити доступ до вашої
            персональної інформації або її виправлення. Ви можете подати такий
            запит, зв’язавшись із нами за контактними даними, наведеними в
            розділі “
            <PageInnerLink scrollTo={scrollToSection} index={14}>
              15. ЯК ВИ МОЖЕТЕ ПЕРЕГЛЯНУТИ, ОНОВИТИ АБО ВИДАЛИТИ ДАНІ, ЯКІ МИ
              ЗБИРАЄМО ПРО ВАС?
            </PageInnerLink>
            ”
          </p>
          <p>
            Якщо вас не влаштовує спосіб, у який ми розглядаємо будь-які скарги
            щодо обробки вашої персональної інформації, ви можете звернутися до
            офісу регулятора, контактні дані якого наведені нижче:
          </p>

          <p style={{ textDecoration: "underline" }}>
            Information Regulator (South Africa)
          </p>

          <p>
            Загальні запити:{" "}
            <span style={{ textDecoration: "underline" }}>
              enquiries@inforegulator.org.za
            </span>
          </p>

          <p>
            Скарги (заповніть форму POPIA/PAIA form 5):{" "}
            <span style={{ textDecoration: "underline" }}>
              PAIAComplaints@inforegulator.org.za
            </span>{" "}
            &{" "}
            <span style={{ textDecoration: "underline" }}>
              POPIAComplaints@inforegulator.org.za
            </span>
          </p>
        </div>
      </div>

      {/* 13 */}
      <div ref={(el) => (sectionRefs.current[12] = el)}>
        {/* title */}
        <h4>13. ЧИ ОНОВЛЮЄМО МИ ЦЕ ПОВІДОМЛЕННЯ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми можемо час від часу оновлювати це Повідомлення про
            конфіденційність. Оновлена версія буде позначена оновленою датою
            “Оновлено” у верхній частині цього Повідомлення про
            конфіденційність. Якщо ми внесемо суттєві зміни до цього
            Повідомлення про конфіденційність, ми можемо повідомити вас або
            шляхом помітного розміщення повідомлення про такі зміни, або шляхом
            безпосереднього надсилання вам сповіщення. Ми рекомендуємо вам
            регулярно переглядати це Повідомлення про конфіденційність, щоб бути
            поінформованими про те, як ми захищаємо вашу інформацію.
          </p>
        </div>
      </div>

      {/* 14 */}
      <div ref={(el) => (sectionRefs.current[13] = el)}>
        {/* title */}
        <h4>14. ЯК ВИ МОЖЕТЕ ЗВ’ЯЗАТИСЯ З НАМИ ЩОДО ЦЬОГО ПОВІДОМЛЕННЯ?</h4>
        {/* body */}
        <div className="body">
          <p>
            Якщо у вас є запитання або коментарі щодо цього повідомлення, ви
            можете написати нам електронною поштою на{" "}
            <span style={{ textDecoration: "underline" }}>
              wordfortodaycontact@gmail.com
            </span>
            .
          </p>
        </div>
      </div>

      {/* 15 */}
      <div ref={(el) => (sectionRefs.current[14] = el)}>
        {/* title */}
        <h4>
          15. ЯК ВИ МОЖЕТЕ ПЕРЕГЛЯНУТИ, ОНОВИТИ АБО ВИДАЛИТИ ДАНІ, ЯКІ МИ
          ЗБИРАЄМО ПРО ВАС?
        </h4>
        {/* body */}
        <div className="body">
          <p>
            Відповідно до чинного законодавства вашої країни або штату
            проживання у США, ви можете мати право запитувати доступ до
            персональної інформації, яку ми збираємо про вас, деталі того, як ми
            її обробляємо, виправлення неточностей або видалення вашої
            персональної інформації. Користувачі можуть у будь-який час подати
            запит на видалення свого облікового запису та пов’язаної з ним
            персональної інформації через додаток або зв’язавшись із нами. Ви
            також можете мати право відкликати свою згоду на обробку вашої
            персональної інформації. Ці права можуть бути обмежені в певних
            випадках відповідно до чинного законодавства. Щоб подати запит на
            перегляд, оновлення або видалення вашої персональної інформації,
            будь ласка, напишіть нам на{" "}
            <span style={{ textDecoration: "underline" }}>
              wordfortodaycontact@gmail.com
            </span>
            .
          </p>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicy;

const PageInnerLink = ({ scrollTo, index, children }) => {
  return (
    <span
      style={{ cursor: "pointer", textDecoration: "underline" }}
      onClick={() => scrollTo(index)}
      role="button"
    >
      {children}
    </span>
  );
};
