const TermsOfUse = () => {
  return (
    <div className="policy-container">
      {/* 1 */}
      <div>
        {/* title */}
        <h4>1. НАШІ ПОСЛУГИ</h4>
        {/* p */}
        <div className="p">
          <p>
            Інформація, що надається під час використання Послуг, не призначена
            для розповсюдження або використання будь-якою особою чи організацією
            в будь-якій юрисдикції або країні, де таке розповсюдження чи
            використання суперечило б законам або нормативним актам чи могло б
            призвести до виникнення для нас будь-яких вимог щодо реєстрації в
            такій юрисдикції або країні. Відповідно, особи, які вирішують
            користуватися Послугами з інших місць, роблять це за власною
            ініціативою та несуть повну відповідальність за дотримання місцевого
            законодавства, якщо і в тій мірі, в якій таке законодавство є
            застосовним.
          </p>
        </div>
      </div>

      {/* 2 */}
      <div>
        {/* title */}
        <h4>2. ПРАВА ІНТЕЛЕКТУАЛЬНОЇ ВЛАСНОСТІ</h4>
        {/* p */}
        <div className="p">
          <p>
            Ми є власником або ліцензіатом усіх прав інтелектуальної власності
            щодо наших Послуг, включаючи весь вихідний код, бази даних,
            функціональні можливості, програмне забезпечення, дизайн вебсайту,
            аудіо, відео, текст, фотографії та графіку, що містяться в Послугах
            (разом — «Контент»), а також торговельні марки, знаки обслуговування
            та логотипи, що містяться в них («Знаки»).
          </p>

          <p>
            Наш Контент і Знаки захищені законами про авторське право та
            торговельні марки (а також іншими законами про інтелектуальну
            власність і недобросовісну конкуренцію) та міжнародними угодами по
            всьому світу.
          </p>

          <p>
            Контент і Знаки надаються в межах або через Послуги «ЯК Є» виключно
            для вашого особистого, некомерційного використання або для
            внутрішніх бізнес-цілей.
          </p>

          <h5>Ваше використання наших Послуг</h5>

          <div>
            <p>
              За умови дотримання вами цих Юридичних умов, включаючи розділ «4.
              ЗАБОРОНЕНІ ДІЇ» нижче, ми надаємо вам невиключну, непередавану та
              відкличну ліцензію на:
            </p>

            <p>• доступ до Послуг; та</p>

            <p>
              • завантаження або друк копії будь-якої частини Контенту, до якої
              ви отримали належний доступ,
            </p>

            <p>
              виключно для вашого особистого, некомерційного використання або
              внутрішніх бізнес-цілей.
            </p>

            <p>
              За винятком випадків, прямо передбачених у цьому розділі або в
              інших положеннях наших Юридичних умов, жодна частина Послуг, а
              також жоден Контент чи Знаки не можуть бути скопійовані,
              відтворені, зібрані, повторно опубліковані, завантажені,
              розміщені, публічно показані, закодовані, перекладені, передані,
              розповсюджені, продані, ліцензовані або іншим чином використані з
              будь-якою комерційною метою без нашого попереднього письмового
              дозволу.
            </p>

            <p>
              Якщо ви бажаєте використовувати Послуги, Контент або Знаки
              будь-яким способом, не передбаченим цим розділом або іншими
              положеннями наших Юридичних умов, будь ласка, надсилайте ваш запит
              на адресу:{" "}
              <span style={{ textDecoration: "underline" }}>
                wordfortodaycontact@gmail.com
              </span>
              . Якщо ми надамо вам дозвіл на розміщення, відтворення або
              публічний показ будь-якої частини наших Послуг або Контенту, ви
              повинні вказати нас як власників або ліцензіарів Послуг, Контенту
              чи Знаків, а також забезпечити відображення будь-якого
              повідомлення про авторські права або право власності під час
              розміщення, відтворення або показу нашого Контенту.
            </p>

            <p>
              Ми залишаємо за собою всі права щодо Послуг, Контенту та Знаків,
              які прямо не надані вам.
            </p>

            <p>
              Будь-яке порушення цих Прав інтелектуальної власності
              вважатиметься істотним порушенням наших Юридичних умов, і ваше
              право користуватися нашими Послугами буде негайно припинено.
            </p>
          </div>

          <h5>Ваші матеріали</h5>

          <div>
            <p>
              Будь ласка, уважно ознайомтеся з цим розділом та розділом
              «ЗАБОРОНЕНІ ДІЇ» перед використанням наших Послуг, щоб зрозуміти:
              (a) які права ви надаєте нам, та (b) які обов’язки ви маєте, коли
              розміщуєте або завантажуєте будь-який контент через Послуги.
            </p>

            <p>
              <b>Матеріали:</b> Надсилаючи нам безпосередньо будь-які запитання,
              коментарі, пропозиції, ідеї, відгуки або іншу інформацію щодо
              Послуг («Матеріали»), ви погоджуєтеся передати нам усі права
              інтелектуальної власності на такі Матеріали. Ви погоджуєтеся, що
              ми будемо володіти такими Матеріалами та матимемо право необмежено
              використовувати й поширювати їх для будь-яких законних цілей,
              комерційних чи інших, без зазначення авторства або виплати вам
              компенсації.
            </p>

            <div className="indent">
              <p>
                • ви підтверджуєте, що ознайомилися та погоджуєтеся з нашим
                розділом «ЗАБОРОНЕНІ ДІЇ» і не будете розміщувати, надсилати,
                публікувати, завантажувати або передавати через Послуги будь-які
                Матеріали, які є незаконними, образливими, ненависницькими,
                шкідливими, наклепницькими, непристойними, такими, що містять
                цькування, насильство, дискримінацію, погрози будь-якій особі
                або групі осіб, сексуально відвертий контент, неправдиву,
                неточну, оманливу або вводячу в оману інформацію;
              </p>

              <p>
                • у межах, дозволених чинним законодавством, ви відмовляєтеся
                від будь-яких моральних прав щодо таких Матеріалів;
              </p>

              <p>
                • ви гарантуєте, що такі Матеріали є вашими оригінальними
                роботами або що ви маєте всі необхідні права та ліцензії для
                подання таких Матеріалів, а також повноваження надати нам
                вищезазначені права щодо ваших Матеріалів; та
              </p>

              <p>
                • ви гарантуєте та підтверджуєте, що ваші Матеріали не містять
                конфіденційної інформації.
              </p>
            </div>

            <p>
              Ви несете повну відповідальність за ваші Матеріали та прямо
              погоджуєтеся відшкодувати нам будь-які збитки, яких ми можемо
              зазнати через порушення вами (a) цього розділу, (b) прав
              інтелектуальної власності будь-якої третьої сторони або (c)
              чинного законодавства.
            </p>
          </div>
        </div>
      </div>

      {/* 3 */}
      <div>
        {/* title */}
        <h4>3. ПРЕДСТАВЛЕННЯ ТА ГАРАНТІЇ КОРИСТУВАЧА</h4>
        {/* body */}
        <div className="body">
          <p>
            Користуючись Сервісами, ви заявляєте та гарантуєте, що: (1) маєте
            законну дієздатність і погоджуєтеся дотримуватися цих Юридичних
            умов; (2) не є неповнолітньою особою у юрисдикції вашого проживання;
            (3) не будете отримувати доступ до Сервісів за допомогою
            автоматизованих або не людських засобів, зокрема через ботів,
            скрипти чи інші подібні методи; (4) не будете використовувати
            Сервіси для будь-яких незаконних або несанкціонованих цілей; та (5)
            ваше використання Сервісів не порушуватиме жодного застосовного
            закону чи нормативного акта.
          </p>

          <p>
            Якщо ви надасте будь-яку інформацію, яка є неправдивою, неточною,
            неактуальною або неповною, ми маємо право призупинити або припинити
            дію вашого облікового запису та відмовити вам у будь-якому поточному
            або майбутньому використанні Сервісів (або будь-якої їх частини).
          </p>
        </div>
      </div>

      {/* 4 */}
      <div>
        {/* title */}
        <h4>4. ЗАБОРОНЕНІ ДІЇ</h4>
        {/* body */}
        <div className="body">
          <p>
            Ви не можете отримувати доступ до Сервісів або використовувати їх
            для будь-яких цілей, окрім тих, для яких ми надаємо Сервіси. Сервіси
            не можуть використовуватися у зв’язку з будь-якою комерційною
            діяльністю, окрім тієї, яка була прямо схвалена або дозволена нами.
          </p>

          <p>Як користувач Сервісів, ви погоджуєтеся не:</p>

          <div className="indent">
            <p>
              • Систематично отримувати дані або інший контент із Сервісів для
              створення чи компіляції, прямо або опосередковано, колекції,
              збірки, бази даних або каталогу без нашого письмового дозволу.
            </p>

            <p>
              • Обманювати, шахраювати або вводити в оману нас чи інших
              користувачів, особливо з метою отримання конфіденційної інформації
              облікового запису, такої як паролі користувачів.
            </p>
            <p>
              • Обходити, вимикати або іншим чином втручатися у функції безпеки
              Сервісів, включаючи функції, які запобігають або обмежують
              використання чи копіювання будь-якого Контенту або забезпечують
              обмеження щодо використання Сервісів та/або Контенту, що міститься
              в них.
            </p>

            <p>
              • Дискредитувати, паплюжити або іншим чином, на нашу думку,
              завдавати шкоди нам та/або Сервісам.
            </p>

            <p>
              • Використовувати будь-яку інформацію, отриману із Сервісів, з
              метою переслідування, образи або заподіяння шкоди іншій особі.
            </p>

            <p>
              • Неправомірно використовувати наші служби підтримки або подавати
              неправдиві повідомлення про зловживання чи неналежну поведінку.
            </p>

            <p>
              • Використовувати Сервіси у спосіб, що суперечить будь-яким
              застосовним законам або нормативним актам.
            </p>

            <p>
              • Здійснювати несанкціоноване фреймування або створення посилань
              на Сервіси.
            </p>

            <p>
              • Завантажувати або передавати (або намагатися завантажити чи
              передати) віруси, троянські програми чи інші шкідливі матеріали,
              включаючи надмірне використання великих літер і спам (безперервне
              розміщення повторюваного тексту), що перешкоджають безперервному
              використанню та користуванню Сервісами будь-якою стороною або
              змінюють, погіршують, порушують, модифікують чи іншим чином
              втручаються у використання, функції, роботу або підтримку
              Сервісів.
            </p>

            <p>
              • Брати участь у будь-якому автоматизованому використанні системи,
              наприклад використовувати скрипти для надсилання коментарів або
              повідомлень, чи застосовувати інструменти для збору та вилучення
              даних, такі як data mining, роботи або подібні засоби.
            </p>

            <p>
              • Видаляти повідомлення про авторські права або інші права
              власності з будь-якого Контенту.
            </p>

            <p>
              • Намагатися видавати себе за іншого користувача чи особу або
              використовувати ім’я користувача іншого користувача.
            </p>

            <p>
              • Завантажувати або передавати (або намагатися завантажити чи
              передати) будь-які матеріали, які діють як пасивний або активний
              механізм збору чи передачі інформації, включаючи, без обмежень,
              графічні формати обміну (“gifs”), пікселі 1x1, веб-маяки, cookies
              або інші подібні пристрої (іноді їх називають “spyware”,
              “пасивними механізмами збору” або “pcms”).
            </p>

            <p>
              • Втручатися, порушувати роботу або створювати надмірне
              навантаження на Сервіси чи мережі або сервіси, пов’язані із
              Сервісами.
            </p>

            <p>
              • Переслідувати, дратувати, залякувати або погрожувати будь-якому
              з наших працівників чи агентів, які надають вам будь-яку частину
              Сервісів.
            </p>

            <p>
              • Намагатися обійти будь-які заходи Сервісів, спрямовані на
              запобігання або обмеження доступу до Сервісів чи будь-якої їх
              частини.
            </p>

            <p>
              • Копіювати або адаптувати програмне забезпечення Сервісів,
              включаючи, але не обмежуючись Flash, PHP, HTML, JavaScript або
              іншим кодом.
            </p>

            <p>
              • За винятком випадків, дозволених чинним законодавством,
              розшифровувати, декомпілювати, дизасемблювати або здійснювати
              зворотне проєктування будь-якого програмного забезпечення, що є
              частиною Сервісів або будь-яким чином їх формує.
            </p>

            <p>
              • За винятком стандартного використання пошукових систем або
              інтернет-браузерів, використовувати, запускати, розробляти або
              поширювати будь-які автоматизовані системи, включаючи, без
              обмежень, spider, robot, cheat utility, scraper або offline
              reader, які отримують доступ до Сервісів, а також використовувати
              або запускати будь-які несанкціоновані скрипти чи інше програмне
              забезпечення.
            </p>

            <p>
              • Використовувати агента з купівлі або закупівельного агента для
              здійснення покупок через Сервіси.
            </p>

            <p>
              • Здійснювати будь-яке несанкціоноване використання Сервісів,
              включаючи збір імен користувачів та/або електронних адрес
              користувачів електронними чи іншими способами з метою надсилання
              небажаних електронних листів або створення облікових записів
              автоматизованими засобами чи під неправдивими приводами.
            </p>

            <p>
              • Використовувати Сервіси як частину будь-яких зусиль для
              конкуренції з нами або іншим чином використовувати Сервіси та/або
              Контент для будь-якої діяльності, що приносить дохід, чи
              комерційного підприємства.
            </p>
          </div>
        </div>
      </div>

      {/* 5 */}
      <div>
        {/* title */}
        <h4>5. КОНТЕНТ, СТВОРЕНИЙ КОРИСТУВАЧАМИ</h4>
        {/* body */}
        <div className="body">
          <p>
            Сервіси не надають користувачам можливості надсилати або публікувати
            контент. Ми можемо надати вам можливість створювати, надсилати,
            публікувати, відображати, передавати, виконувати, поширювати або
            транслювати контент і матеріали нам або через Сервіси, включаючи,
            але не обмежуючись, текстами, письмовими матеріалами, відео, аудіо,
            фотографіями, графікою, коментарями, пропозиціями, персональною
            інформацією чи іншими матеріалами (разом — “Contributions”).
            Contributions можуть бути доступними для перегляду іншими
            користувачами Сервісів та через вебсайти третіх сторін. Створюючи
            або роблячи доступними будь-які Contributions, ви тим самим
            заявляєте та гарантуєте, що:
          </p>
        </div>
      </div>

      {/* 6 */}
      <div>
        {/* title */}
        <h4>6. ЛІЦЕНЗІЯ НА CONTRIBUTIONS</h4>
        {/* body */}
        <div className="body">
          <p>
            Ви та Сервіси погоджуєтеся, що ми можемо отримувати доступ,
            зберігати, обробляти та використовувати будь-яку інформацію і
            персональні дані, які ви надаєте, а також ваші налаштування та
            вибір.
          </p>

          <p>
            Надсилаючи пропозиції або інший відгук щодо Сервісів, ви
            погоджуєтеся, що ми можемо використовувати та поширювати такий
            відгук для будь-яких цілей без виплати вам компенсації.
          </p>

          <p>
            Ми не заявляємо права власності на ваші Contributions. Ви зберігаєте
            повне право власності на всі свої Contributions, а також на всі
            права інтелектуальної власності чи інші майнові права, пов’язані з
            вашими Contributions. Ми не несемо відповідальності за будь-які
            заяви чи твердження у ваших Contributions, наданих вами в будь-якій
            частині Сервісів. Ви несете повну відповідальність за свої
            Contributions у Сервісах і прямо погоджуєтеся звільнити нас від
            будь-якої відповідальності та утримуватися від будь-яких юридичних
            дій проти нас щодо ваших Contributions.
          </p>
        </div>
      </div>

      {/* 7 */}
      <div>
        {/* title */}
        <h4>7. УПРАВЛІННЯ СЕРВІСАМИ</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми залишаємо за собою право, але не зобов’язання: (1) контролювати
            Сервіси щодо порушень цих Legal Terms; (2) вживати відповідних
            юридичних заходів проти будь-кого, хто, на наш власний розсуд,
            порушує закон або ці Legal Terms, включаючи, без обмежень,
            повідомлення про такого користувача правоохоронним органам; (3) на
            наш власний розсуд і без обмежень відмовляти, обмежувати доступ,
            обмежувати доступність або вимикати (у межах технологічної
            можливості) будь-які ваші Contributions або будь-яку їх частину; (4)
            на наш власний розсуд і без обмежень, повідомлення чи
            відповідальності видаляти із Сервісів або іншим чином вимикати всі
            файли та контент, які є надмірно великими за розміром або будь-яким
            чином створюють навантаження на наші системи; та (5) іншим чином
            управляти Сервісами у спосіб, спрямований на захист наших прав і
            майна та забезпечення належного функціонування Сервісів.
          </p>
        </div>
      </div>

      {/* 8 */}
      <div>
        {/* title */}
        <h4>8. СТРОК ДІЇ ТА ПРИПИНЕННЯ</h4>
        {/* body */}
        <div className="body">
          <p>
            Ці Legal Terms залишаються чинними та мають повну юридичну силу,
            поки ви користуєтеся Сервісами. БЕЗ ОБМЕЖЕННЯ БУДЬ-ЯКОГО ІНШОГО
            ПОЛОЖЕННЯ ЦИХ LEGAL TERMS, МИ ЗАЛИШАЄМО ЗА СОБОЮ ПРАВО НА ВЛАСНИЙ
            РОЗСУД І БЕЗ ПОВІДОМЛЕННЯ ЧИ ВІДПОВІДАЛЬНОСТІ ВІДМОВИТИ У ДОСТУПІ ТА
            ВИКОРИСТАННІ СЕРВІСІВ (ВКЛЮЧАЮЧИ БЛОКУВАННЯ ПЕВНИХ IP-АДРЕС)
            БУДЬ-ЯКІЙ ОСОБІ З БУДЬ-ЯКОЇ ПРИЧИНИ АБО БЕЗ ПРИЧИНИ, ВКЛЮЧАЮЧИ, БЕЗ
            ОБМЕЖЕНЬ, ПОРУШЕННЯ БУДЬ-ЯКОЇ ЗАЯВИ, ГАРАНТІЇ АБО ЗОБОВ’ЯЗАННЯ, ЩО
            МІСТЯТЬСЯ В ЦИХ LEGAL TERMS АБО В БУДЬ-ЯКОМУ ЧИННОМУ ЗАКОНІ ЧИ
            НОРМАТИВНОМУ АКТІ. МИ МОЖЕМО ПРИПИНИТИ ВАШЕ ВИКОРИСТАННЯ АБО УЧАСТЬ
            У СЕРВІСАХ АБО ВИДАЛИТИ
          </p>

          <p>
            Якщо ми припинимо або призупинимо дію вашого облікового запису з
            будь-якої причини, вам забороняється реєструвати та створювати новий
            обліковий запис під своїм ім’ям, вигаданим чи запозиченим ім’ям або
            ім’ям будь-якої третьої особи, навіть якщо ви можете діяти від імені
            такої третьої особи. Окрім припинення або призупинення вашого
            облікового запису, ми залишаємо за собою право вживати відповідних
            юридичних заходів, включаючи, без обмежень, звернення за
            цивільно-правовим, кримінальним та судовим захистом.
          </p>
        </div>
      </div>

      {/* 9 */}
      <div>
        {/* title */}
        <h4>9. ЗМІНИ ТА ПЕРЕРИВАННЯ</h4>
        {/* body */}
        <div className="body">
          <p>
            Ми залишаємо за собою право змінювати, модифікувати або видаляти
            вміст Сервісів у будь-який час і з будь-якої причини на власний
            розсуд без попереднього повідомлення. Однак ми не зобов’язані
            оновлювати будь-яку інформацію у наших Сервісах.
          </p>

          <p>
            Ми не можемо гарантувати, що Сервіси будуть доступні у будь-який
            час. Ми можемо стикатися з апаратними, програмними чи іншими
            проблемами або потребою проводити технічне обслуговування, пов’язане
            із Сервісами, що може призвести до перерв, затримок або помилок. Ми
            залишаємо за собою право змінювати, переглядати, оновлювати,
            призупиняти, припиняти або іншим чином модифікувати Сервіси у
            будь-який час і з будь-якої причини без повідомлення вас. Ви
            погоджуєтеся, що ми не несемо жодної відповідальності за будь-які
            втрати, шкоду або незручності, спричинені вашою неможливістю
            отримати доступ або користуватися Сервісами під час будь-якого
            простою або припинення роботи Сервісів. Ніщо в цих Legal Terms не
            буде тлумачитися як зобов’язання з нашого боку підтримувати та
            обслуговувати Сервіси або надавати будь-які виправлення, оновлення
            чи нові версії у зв’язку з ними.
          </p>
        </div>
      </div>

      {/* 10 */}
      <div>
        <h4>{"10. ЗАСТОСОВНЕ ПРАВО"}</h4>
        <div className="body">
          <p>
            Ці Legal Terms регулюються та тлумачаться відповідно до законів
            Республіки Корея. Word For Today та ви беззастережно погоджуєтеся,
            що суди Республіки Корея матимуть виключну юрисдикцію для вирішення
            будь-яких спорів, які можуть виникнути у зв’язку з цими Legal Terms.
          </p>
        </div>
      </div>

      {/* 11 */}
      <div>
        <h4>{"11. ВИРІШЕННЯ СПОРІВ"}</h4>

        <div className="body">
          <h5>Неформальні переговори</h5>
          <p>
            З метою прискорення вирішення та контролю витрат будь-якого спору,
            суперечки або претензії, пов’язаних із цими Юридичними умовами
            (кожен — &ldquo;Спір&rdquo;, а разом — &ldquo;Спори&rdquo;), поданих
            вами або нами (окремо — &ldquo;Сторона&rdquo;, а разом —
            &ldquo;Сторони&rdquo;), Сторони погоджуються спочатку намагатися
            врегулювати будь-який Спір (за винятком Спорів, прямо зазначених
            нижче) шляхом неформальних переговорів протягом щонайменше 30 днів
            до початку арбітражу. Такі неформальні переговори розпочинаються
            після письмового повідомлення однієї Сторони іншій Стороні.
          </p>

          <h5>Обов’язковий арбітраж</h5>
          <p>
            Будь-який спір, що виникає з цих Юридичних умов або у зв’язку з
            ними, включаючи будь-які питання щодо їх існування, дійсності або
            припинення, передається та остаточно вирішується Міжнародним
            комерційним арбітражним судом при Європейській арбітражній палаті
            (Бельгія, Брюссель, Avenue Louise, 146) відповідно до Правил цього
            ICAC, які, внаслідок посилання на них, вважаються частиною цього
            положення. Кількість арбітрів становитиме одну особу. Місцем
            проведення арбітражу буде Сеул, Південна Корея. Мовою провадження
            буде англійська. Регулюючим правом цих Юридичних умов є матеріальне
            право Республіки Корея.
          </p>

          <h5>Обмеження</h5>
          <p>
            Сторони погоджуються, що будь-який арбітраж обмежується Спором між
            Сторонами індивідуально. У максимально дозволеному законом обсязі:
            (a) жоден арбітраж не може бути об’єднаний з будь-яким іншим
            провадженням; (b) немає права або повноважень для розгляду
            будь-якого Спору у формі колективного позову або із застосуванням
            процедур колективного позову; та (c) немає права або повноважень для
            подання будь-якого Спору в нібито представницькому статусі від імені
            широкої громадськості або будь-яких інших осіб.
          </p>

          <h5>Винятки з неформальних переговорів та арбітражу</h5>
          <p>
            Сторони погоджуються, що наступні Спори не підпадають під наведені
            вище положення щодо неформальних переговорів та обов’язкового
            арбітражу: (a) будь-які Спори, спрямовані на забезпечення або
            захист, або пов’язані з дійсністю будь-яких прав інтелектуальної
            власності Сторони; (b) будь-який Спір, пов’язаний або такий, що
            виникає з обвинувачень у крадіжці, піратстві, порушенні
            конфіденційності або несанкціонованому використанні; та (c) будь-які
            вимоги про судову заборону. Якщо це положення буде визнано
            незаконним або таким, що не підлягає виконанню, тоді жодна Сторона
            не обиратиме арбітраж для будь-якого Спору, що підпадає під частину
            цього положення, визнану незаконною або такою, що не підлягає
            виконанню, і такий Спір буде вирішуватися судом компетентної
            юрисдикції в судах, зазначених вище для юрисдикції, а Сторони
            погоджуються підкорятися персональній юрисдикції такого суду.
          </p>
        </div>
      </div>

      {/* 12 */}
      <div>
        <h4>{"12. ВИПРАВЛЕННЯ"}</h4>
        <div className="body">
          <p>
            У Сервісах може міститися інформація з друкарськими помилками,
            неточностями або пропусками, включаючи описи, ціни, доступність та
            іншу різноманітну інформацію. Ми залишаємо за собою право виправляти
            будь-які помилки, неточності або пропуски, а також змінювати чи
            оновлювати інформацію в Сервісах у будь-який час без попереднього
            повідомлення.
          </p>
        </div>
      </div>

      {/* 13 */}
      <div>
        <h4>{"13. ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ"}</h4>
        <div className="body">
          <p>
            СЕРВІСИ НАДАЮТЬСЯ НА УМОВАХ «ЯК Є» ТА «ЯК ДОСТУПНО». ВИ
            ПОГОДЖУЄТЕСЯ, ЩО ВИКОРИСТАННЯ СЕРВІСІВ ЗДІЙСНЮЄТЬСЯ НА ВАШ ВЛАСНИЙ
            РИЗИК. У МАКСИМАЛЬНОМУ ОБСЯЗІ, ДОЗВОЛЕНОМУ ЗАКОНОМ, МИ ВІДМОВЛЯЄМОСЯ
            ВІД БУДЬ-ЯКИХ ГАРАНТІЙ, ЯВНИХ АБО НЕЯВНИХ, ЩО СТОСУЮТЬСЯ СЕРВІСІВ ТА
            ВАШОГО ЇХ ВИКОРИСТАННЯ, ВКЛЮЧАЮЧИ, БЕЗ ОБМЕЖЕНЬ, НЕЯВНІ ГАРАНТІЇ
            ТОВАРНОЇ ПРИДАТНОСТІ, ПРИДАТНОСТІ ДЛЯ ПЕВНОЇ МЕТИ ТА НЕПОРУШЕННЯ
            ПРАВ. МИ НЕ НАДАЄМО ЖОДНИХ ГАРАНТІЙ АБО ЗАПЕВНЕНЬ ЩОДО ТОЧНОСТІ ЧИ
            ПОВНОТИ ВМІСТУ СЕРВІСІВ АБО ВМІСТУ БУДЬ-ЯКИХ ВЕБСАЙТІВ ЧИ МОБІЛЬНИХ
            ДОДАТКІВ, ПОВ’ЯЗАНИХ ІЗ СЕРВІСАМИ, І НЕ НЕСЕМО ВІДПОВІДАЛЬНОСТІ ЗА
            (1) ПОМИЛКИ, НЕТЧНОСТІ АБО НЕТОЧНОСТІ ВМІСТУ ТА МАТЕРІАЛІВ, (2)
            БУДЬ-ЯКІ ТІЛЕСНІ УШКОДЖЕННЯ АБО МАТЕРІАЛЬНІ ЗБИТКИ, ЩО ВИНИКЛИ В
            РЕЗУЛЬТАТІ ВАШОГО ДОСТУПУ ДО СЕРВІСІВ ТА ЇХ ВИКОРИСТАННЯ, (3)
            БУДЬ-ЯКИЙ НЕСАНКЦІОНОВАНИЙ ДОСТУП ДО НАШИХ ЗАХИЩЕНИХ СЕРВЕРІВ ТА/АБО
            ОСОБИСТОЇ ЧИ ФІНАНСОВОЇ ІНФОРМАЦІЇ, ЩО ЗБЕРІГАЄТЬСЯ НА НИХ, (4)
            БУДЬ-ЯКЕ ПЕРЕРИВАННЯ АБО ПРИПИНЕННЯ ПЕРЕДАЧІ ДАНИХ ДО АБО ВІД
            СЕРВІСІВ, (5) БУДЬ-ЯКІ ПОМИЛКИ, ВІРУСИ, ТРОЯНСЬКІ ПРОГРАМИ АБО ІНШІ
            ШКІДЛИВІ КОМПОНЕНТИ, ЯКІ МОЖУТЬ БУТИ ПЕРЕДАНІ ЧЕРЕЗ СЕРВІСИ ТРЕТІМИ
            ОСОБАМИ, ТА/АБО (6) БУДЬ-ЯКІ ПОМИЛКИ ЧИ ПРОПУСКИ У ВМІСТІ ТА
            МАТЕРІАЛАХ АБО БУДЬ-ЯКІ ЗБИТКИ, ПОНЕСЕНІ В РЕЗУЛЬТАТІ ВИКОРИСТАННЯ
            БУДЬ-ЯКОГО ВМІСТУ, ОПУБЛІКОВАНОГО, ПЕРЕДАНОГО АБО ІНШИМ ЧИНОМ
            ДОСТУПНОГО ЧЕРЕЗ СЕРВІСИ. МИ НЕ ГАРАНТУЄМО, НЕ ПІДТРИМУЄМО І НЕ
            НЕСЕМО ВІДПОВІДАЛЬНОСТІ ЗА БУДЬ-ЯКІ ПРОДУКТИ АБО ПОСЛУГИ, ЩО
            РЕКЛАМУЮТЬСЯ АБО ПРОПОНУЮТЬСЯ ТРЕТІМИ ОСОБАМИ ЧЕРЕЗ СЕРВІСИ,
            БУДЬ-ЯКІ ГІПЕРПОСИЛАННЯ НА ВЕБСАЙТИ АБО БУДЬ-ЯКІ ВЕБСАЙТИ ЧИ
            МОБІЛЬНІ ДОДАТКИ, ПРЕДСТАВЛЕНІ В БАНЕРАХ ЧИ ІНШІЙ РЕКЛАМІ, І МИ НЕ
            БУДЕМО СТОРОНОЮ АБО ВІДПОВІДАЛЬНИМИ ЗА МОНІТОРИНГ БУДЬ-ЯКИХ УГОД МІЖ
            ВАМИ ТА БУДЬ-ЯКИМИ СТОРОННІМИ ПОСТАЧАЛЬНИКАМИ ПРОДУКТІВ АБО ПОСЛУГ.
            ЯК І ПРИ ПРИДБАННІ БУДЬ-ЯКОГО ПРОДУКТУ АБО ПОСЛУГИ ЧЕРЕЗ БУДЬ-ЯКИЙ
            КАНАЛ АБО В БУДЬ-ЯКОМУ СЕРЕДОВИЩІ, ВИ ПОВИННІ КЕРУВАТИСЯ ВЛАСНИМ
            ЗДОРОВИМ ГЛУЗДОМ І ПРОЯВЛЯТИ ОБЕРЕЖНІСТЬ, ДЕ ЦЕ ДОЦІЛЬНО.
          </p>
        </div>
      </div>

      {/* 14 */}
      <div>
        <h4>{"14. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ"}</h4>
        <div className="body">
          <p>
            НІ ЗА ЯКИХ ОБСТАВИН МИ, НАШІ ДИРЕКТОРИ, СПІВРОБІТНИКИ АБО АГЕНТИ НЕ
            НЕСЕМО ВІДПОВІДАЛЬНОСТІ ПЕРЕД ВАМИ АБО БУДЬ-ЯКОЮ ТРЕТЬОЮ ОСОБОЮ ЗА
            БУДЬ-ЯКІ ПРЯМІ, НЕПРЯМІ, ПОБІЧНІ, СПЕЦІАЛЬНІ, ШТРАФНІ АБО ІНШІ
            ЗБИТКИ, ВКЛЮЧАЮЧИ ВТРАТУ ПРИБУТКУ, ДОХОДУ, ДАНИХ АБО ІНШІ ЗБИТКИ, ЩО
            ВИНИКАЮТЬ ВНАСЛІДОК ВИКОРИСТАННЯ ВАМИ СЕРВІСІВ, НАВІТЬ ЯКЩО МИ БУЛИ
            ПОВІДОМЛЕНІ ПРО МОЖЛИВІСТЬ ТАКИХ ЗБИТКІВ. НЕЗВАЖАЮЧИ НА БУДЬ-ЩО
            ПРОТИЛЕЖНЕ, ВИКЛАДЕНЕ ТУТ, НАША ВІДПОВІДАЛЬНІСТЬ ПЕРЕД ВАМИ З
            БУДЬ-ЯКОЇ ПРИЧИНИ ТА НЕЗАЛЕЖНО ВІД ФОРМИ ПОЗОВУ ЗАВЖДИ БУДЕ ОБМЕЖЕНА
            МЕНШОЮ З ТАКИХ СУМ: СУМОЮ, ЯКУ ВИ, ЯКЩО ТАКА Є, СПЛАТИЛИ НАМ, АБО .
            ДЕЯКІ ЗАКОНИ ШТАТІВ США ТА МІЖНАРОДНІ ЗАКОНИ НЕ ДОЗВОЛЯЮТЬ ОБМЕЖЕННЯ
            НЕЯВНИХ ГАРАНТІЙ АБО ВИКЛЮЧЕННЯ ЧИ ОБМЕЖЕННЯ ПЕВНИХ ВИДІВ ЗБИТКІВ.
            ЯКЩО ЦІ ЗАКОНИ ПОШИРЮЮТЬСЯ НА ВАС, ДЕЯКІ АБО ВСІ ВИЩЕЗАЗНАЧЕНІ
            ВІДМОВИ ВІД ВІДПОВІДАЛЬНОСТІ ЧИ ОБМЕЖЕННЯ МОЖУТЬ НЕ ЗАСТОСОВУВАТИСЯ
            ДО ВАС, І ВИ МОЖЕТЕ МАТИ ДОДАТКОВІ ПРАВА.
          </p>
        </div>
      </div>

      {/* 15 */}
      <div>
        <h4>15. ВІДШКОДУВАННЯ ЗБИТКІВ</h4>
        <div className="body">
          <p>
            Ви погоджуєтеся захищати, відшкодовувати збитки та звільняти нас від
            відповідальності, включаючи наші дочірні компанії, афілійовані
            особи, а також усіх наших посадових осіб, агентів, партнерів і
            працівників, від будь-яких втрат, збитків, відповідальності,
            претензій або вимог, включаючи обґрунтовані витрати на адвокатів та
            судові витрати, висунутих будь-якою третьою стороною внаслідок або у
            зв’язку з: (1) використанням Сервісів; (2) порушенням цих Юридичних
            умов; (3) порушенням будь-яких ваших заяв і гарантій, викладених у
            цих Юридичних умовах; (4) порушенням вами прав третьої сторони,
            включаючи, але не обмежуючись, правами інтелектуальної власності;
            або (5) будь-якими умисними шкідливими діями щодо іншого користувача
            Сервісів, з яким ви взаємодіяли через Сервіси. Незважаючи на
            вищезазначене, ми залишаємо за собою право, за ваш рахунок, взяти на
            себе виключний захист і контроль будь-якої справи, щодо якої ви
            зобов’язані відшкодувати нам збитки, і ви погоджуєтеся
            співпрацювати, за власний рахунок, у нашому захисті від таких
            претензій. Ми докладатимемо розумних зусиль, щоб повідомити вас про
            будь-яку таку претензію, позов або провадження, що підлягає такому
            відшкодуванню, щойно нам стане про це відомо.
          </p>
        </div>
      </div>

      {/* 16 */}
      <div>
        <h4>{"16. ДАНІ КОРИСТУВАЧА"}</h4>
        <div className="body">
          <p>
            Ми зберігатимемо певні дані, які ви передаєте до Сервісів, з метою
            управління роботою Сервісів, а також дані, пов’язані з вашим
            використанням Сервісів. Хоча ми регулярно виконуємо резервне
            копіювання даних, ви несете повну відповідальність за всі дані, які
            ви передаєте, або які стосуються будь-якої діяльності, здійсненої
            вами за допомогою Сервісів. Ви погоджуєтеся, що ми не несемо перед
            вами жодної відповідальності за будь-яку втрату або пошкодження
            таких даних, і цим відмовляєтеся від будь-якого права на позов проти
            нас, що виникає внаслідок такої втрати або пошкодження даних.
          </p>
        </div>
      </div>

      {/* 17 */}
      <div>
        <h4>17. ЕЛЕКТРОННІ КОМУНІКАЦІЇ, ТРАНЗАКЦІЇ ТА ПІДПИСИ</h4>
        <div className="body">
          <p>
            Відвідування Сервісів, надсилання нам електронних листів та
            заповнення онлайн-форм є електронними комунікаціями. Ви погоджуєтеся
            отримувати електронні повідомлення та визнаєте, що всі угоди,
            повідомлення, розкриття інформації та інші повідомлення, які ми
            надаємо вам в електронній формі — електронною поштою або через
            Сервіси — задовольняють будь-яку юридичну вимогу щодо письмової
            форми таких повідомлень. ЦИМ ВИ ПОГОДЖУЄТЕСЯ НА ВИКОРИСТАННЯ
            ЕЛЕКТРОННИХ ПІДПИСІВ, ДОГОВОРІВ, ЗАМОВЛЕНЬ ТА ІНШИХ ЗАПИСІВ, А ТАКОЖ
            НА ЕЛЕКТРОННЕ НАДСИЛАННЯ ПОВІДОМЛЕНЬ, ПОЛІТИК І ЗАПИСІВ ПРО
            ТРАНЗАКЦІЇ, ІНІЦІЙОВАНІ АБО ЗАВЕРШЕНІ НАМИ ЧИ ЧЕРЕЗ СЕРВІСИ. ЦИМ ВИ
            ВІДМОВЛЯЄТЕСЯ ВІД БУДЬ-ЯКИХ ПРАВ АБО ВИМОГ, ПЕРЕДБАЧЕНИХ ЗАКОНАМИ,
            НОРМАТИВНИМИ АКТАМИ, ПРАВИЛАМИ, ПОСТАНОВАМИ ЧИ ІНШИМИ НОРМАМИ
            БУДЬ-ЯКОЇ ЮРИСДИКЦІЇ, ЯКІ ВИМАГАЮТЬ ОРИГІНАЛЬНОГО ПІДПИСУ АБО
            НАДАННЯ ЧИ ЗБЕРІГАННЯ НЕЕЛЕКТРОННИХ ДОКУМЕНТІВ, А ТАКОЖ ЩОДО
            ПЛАТЕЖІВ АБО НАДАННЯ КРЕДИТІВ БУДЬ-ЯКИМИ ІНШИМИ СПОСОБАМИ, КРІМ
            ЕЛЕКТРОННИХ.
          </p>
        </div>
      </div>

      {/* 18 */}
      <div>
        <h4>18. РІЗНЕ</h4>
        <div className="body">
          <p>
            Ці Юридичні умови, а також будь-які політики чи правила
            користування, опубліковані нами в Сервісах або щодо Сервісів,
            становлять повну угоду та взаєморозуміння між вами та нами.
            Невикористання або незастосування нами будь-якого права чи положення
            цих Юридичних умов не вважається відмовою від такого права чи
            положення. Ці Юридичні умови діють у максимально дозволеному законом
            обсязі. Ми можемо передавати будь-які або всі наші права та
            обов’язки іншим особам у будь-який час. Ми не несемо
            відповідальності за будь-які втрати, збитки, затримки або
            невиконання зобов’язань, спричинені обставинами поза межами нашого
            розумного контролю. Якщо будь-яке положення або частина положення
            цих Юридичних умов буде визнано незаконним, недійсним або таким, що
            не підлягає виконанню, таке положення або його частина вважається
            відокремлюваним від цих Юридичних умов і не впливає на чинність та
            можливість виконання будь-яких інших положень. У результаті цих
            Юридичних умов або використання Сервісів між вами та нами не виникає
            жодних відносин спільного підприємства, партнерства,
            працевлаштування чи агентських відносин. Ви погоджуєтеся, що ці
            Юридичні умови не будуть тлумачитися проти нас лише через те, що ми
            їх склали. Цим ви відмовляєтеся від будь-яких заперечень, які можете
            мати у зв’язку з електронною формою цих Юридичних умов та
            відсутністю підписів сторін для набуття ними чинності.
          </p>
        </div>
      </div>

      {/* 19 */}
      <div>
        <h4>{"19. ЗВ’ЯЖІТЬСЯ З НАМИ"}</h4>
        <div className="body">
          <p>
            Щоб вирішити скаргу щодо Сервісів або отримати додаткову інформацію
            щодо використання Сервісів, будь ласка, зв’яжіться з нами за
            адресою:{" "}
            <span style={{ textDecoration: "underline" }}>
              wordfortodaycontact@gmail.com
            </span>
          </p>
        </div>
      </div>
    </div>
  );
};

export default TermsOfUse;

const PageInnerLink = ({ scrollTo, index, children }) => {
  return (
    <span
      style={{ cursor: "pointer", textDecoration: "underline" }}
      onClick={() => scrollTo(index)}
      role="button"
    >
      {children}
    </span>
  );
};
